export enum Jobs {
  "무직" = "무직",
  "무도가" = "무도가",
  "투사" = "투사",
  "전사" = "전사",
  "검사" = "검사",
  "검객" = "검객",
  "악사" = "악사",
  "궁사" = "궁사",
  "자객" = "자객",
  "네크로멘서" = "네크로멘서",
  "모험가" = "모험가",
  "상인" = "상인",
  "순수기사" = "순수기사",
  "빛의기사" = "빛의기사",
  "어둠의기사" = "어둠의기사",
  "순수마법사" = "순수마법사",
  "빛의마법사" = "빛의마법사",
  "어둠의마법사" = "어둠의마법사",
  "탐색가" = "탐색가",
  "자연인" = "자연인",
  "음유시인" = "음유시인",
  "정령술사" = "정령술사",
}

export enum NumberedJobs {
  "무직" = 10, // k
  "무도가", // l
  "투사", // n
  "전사", // m
  "검사", // o
  "검객", // p
  "악사", // q
  "궁사", // r
  "자객",
  "네크로멘서",
  "모험가",
  "상인",
  "순수기사",
  "빛의기사",
  "어둠의기사",
  "순수마법사", // z
  "빛의마법사", // A
  "어둠의마법사",
  "탐색가",
  "자연인",
  "음유시인",
  "정령술사", // F
}

export const classifiedJobs = [
  ["무도가", "투사", "전사", "검사", "검객", "악사", "궁사", "자객"],
  [
    "순수기사",
    "빛의기사",
    "어둠의기사",
    "순수마법사",
    "빛의마법사",
    "어둠의마법사",
  ],
  ["모험가", "탐색가", "자연인", "음유시인", "정령술사", "상인", "네크로멘서"],
];

export default [
  "무도가",
  "투사",
  "전사",
  "검사",
  "검객",
  "악사",
  "궁사",
  "자객",
  "네크로멘서",
  "순수기사",
  "빛의기사",
  "어둠의기사",
  "순수마법사",
  "빛의마법사",
  "어둠의마법사",
  "모험가",
  "탐색가",
  "자연인",
  "음유시인",
  "정령술사",
];
